{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[60, 20], [1, 1]], "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\n\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0001N)\u0001\u00da\u0010resize_normalize)\u0001\u00da\u0001x\u00a9\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>P\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "output_shape": [66, 200, 3], "batch_input_shape": [null, 80, 318, 3], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_col": 5, "name": "conv1", "activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "nb_row": 5, "bias": true, "nb_filter": 24, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_col": 5, "name": "conv2", "activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "nb_row": 5, "bias": true, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_col": 5, "name": "conv3", "activity_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "nb_row": 5, "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_col": 3, "name": "conv4", "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "nb_row": 3, "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_col": 3, "name": "conv5", "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "nb_row": 3, "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "name": "hidden1", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "bias": true, "input_dim": 1152, "output_dim": 1164, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "name": "hidden2", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "bias": true, "input_dim": 1164, "output_dim": 100, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "name": "hidden3", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "bias": true, "input_dim": 100, "output_dim": 50, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "name": "hidden4", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "bias": true, "input_dim": 50, "output_dim": 10, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "name": "output", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "activation": "tanh", "bias": true, "input_dim": 10, "output_dim": 1, "b_regularizer": null}}]}