{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[60, 20], [1, 1]]}, "class_name": "Cropping2D"}, {"config": {"arguments": {}, "input_dtype": "float32", "name": "lambda_1", "trainable": true, "output_shape": [66, 200, 3], "output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize4\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\b\u0015\u0002\u000e\u0002", null, null]}, "class_name": "Lambda"}, {"config": {"nb_row": 5, "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "dim_ordering": "tf", "nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "name": "conv1", "bias": true, "W_regularizer": null, "nb_col": 5, "border_mode": "valid", "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "dim_ordering": "tf", "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "name": "conv2", "bias": true, "W_regularizer": null, "nb_col": 5, "border_mode": "valid", "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "dim_ordering": "tf", "nb_filter": 48, "b_constraint": null, "subsample": [2, 2], "name": "conv3", "bias": true, "W_regularizer": null, "nb_col": 5, "border_mode": "valid", "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "dim_ordering": "tf", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "name": "conv4", "bias": true, "W_regularizer": null, "nb_col": 3, "border_mode": "valid", "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "b_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "dim_ordering": "tf", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "name": "conv5", "bias": true, "W_regularizer": null, "nb_col": 3, "border_mode": "valid", "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1164, "input_dim": 1152, "activity_regularizer": null, "name": "hidden1", "bias": true, "W_regularizer": null, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 100, "input_dim": 1164, "activity_regularizer": null, "name": "hidden2", "bias": true, "W_regularizer": null, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "name": "hidden3", "bias": true, "W_regularizer": null, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "name": "hidden4", "bias": true, "W_regularizer": null, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "name": "output", "bias": true, "W_regularizer": null, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}