{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[60, 20], [1, 1]], "name": "cropping2d_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\n\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0001N)\u0001\u00da\u0010resize_normalize)\u0001\u00da\u0001x\u00a9\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>B\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [66, 200, 3], "input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 80, 318, 3]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "activity_regularizer": null, "activation": "tanh", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "nb_filter": 24, "name": "conv1", "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "activity_regularizer": null, "activation": "tanh", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "nb_filter": 36, "name": "conv2", "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 5, "activity_regularizer": null, "activation": "tanh", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "nb_filter": 48, "name": "conv3", "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "tanh", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "nb_filter": 64, "name": "conv4", "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "tanh", "b_regularizer": null, "W_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "b_constraint": null, "nb_filter": 64, "name": "conv5", "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 1152, "activity_regularizer": null, "activation": "tanh", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 1164, "b_constraint": null, "b_regularizer": null, "name": "hidden1", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 1164, "activity_regularizer": null, "activation": "tanh", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 100, "b_constraint": null, "b_regularizer": null, "name": "hidden2", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 100, "activity_regularizer": null, "activation": "tanh", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 50, "b_constraint": null, "b_regularizer": null, "name": "hidden3", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 50, "activity_regularizer": null, "activation": "tanh", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 10, "b_constraint": null, "b_regularizer": null, "name": "hidden4", "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 10, "activity_regularizer": null, "activation": "tanh", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 1, "b_constraint": null, "b_regularizer": null, "name": "output", "init": "glorot_uniform"}}]}