{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "trainable": true, "input_dtype": "float32", "cropping": [[60, 20], [1, 1]]}}, {"class_name": "Lambda", "config": {"output_shape": [66, 200, 3], "batch_input_shape": [null, 160, 320, 3], "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize4\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\b\u0015\u0002\u000e\u0002", null, null], "arguments": {}, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "nb_filter": 24, "dim_ordering": "tf", "activation": "tanh", "W_regularizer": null, "subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "conv1", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "nb_filter": 36, "dim_ordering": "tf", "activation": "tanh", "W_regularizer": null, "subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "conv2", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "nb_filter": 48, "dim_ordering": "tf", "activation": "tanh", "W_regularizer": null, "subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "conv3", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "activation": "tanh", "W_regularizer": null, "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "conv4", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "activation": "tanh", "W_regularizer": null, "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "conv5", "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 1164, "input_dim": 1152, "activation": "tanh", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "hidden1", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 100, "input_dim": 1164, "activation": "tanh", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "hidden2", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 50, "input_dim": 100, "activation": "tanh", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "hidden3", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 10, "input_dim": 50, "activation": "tanh", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "hidden4", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 1, "input_dim": 10, "activation": "tanh", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "output", "activity_regularizer": null}}], "keras_version": "1.2.1"}