{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "cropping": [[60, 20], [1, 1]]}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9 \u0000\u0000\u0000\u00e9\u0080\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize5\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\b\u0015\u0002\u000e\u0002", null, null], "output_shape": [32, 128, 3]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 16, "subsample": [1, 1], "activation": "relu", "input_dtype": "float32", "bias": true, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "batch_input_shape": [null, 32, 128, 3], "b_constraint": null, "W_constraint": null, "trainable": true, "name": "convolution2d_1", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 32, "subsample": [1, 1], "activation": "relu", "trainable": true, "bias": true, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "activation": "relu", "trainable": true, "bias": true, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 500, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 1792}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 100, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 500}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 20, "W_constraint": null, "name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 100}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null, "name": "dense_4", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 20}}]}