{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[60, 20], [1, 1]], "name": "cropping2d_1", "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize4\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\b\u0015\u0002\u000e\u0002", null, null], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "input_dtype": "float32", "name": "lambda_1", "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "tanh", "subsample": [2, 2], "bias": true, "nb_col": 5, "nb_row": 5, "nb_filter": 24, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "name": "conv1", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "tanh", "subsample": [2, 2], "bias": true, "nb_col": 5, "nb_row": 5, "nb_filter": 36, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "name": "conv2", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "tanh", "subsample": [2, 2], "bias": true, "nb_col": 5, "nb_row": 5, "nb_filter": 48, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "name": "conv3", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "tanh", "subsample": [1, 1], "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "name": "conv4", "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "tanh", "subsample": [1, 1], "bias": true, "nb_col": 3, "nb_row": 3, "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activity_regularizer": null, "name": "conv5", "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 1164, "input_dim": 1152, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "hidden1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 100, "input_dim": 1164, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "hidden2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 50, "input_dim": 100, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "hidden3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 10, "input_dim": 50, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "hidden4"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 1, "input_dim": 10, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "output"}}], "keras_version": "1.2.1"}