{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[60, 20], [1, 1]], "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "batch_input_shape": [null, 80, 318, 3], "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\n\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0001N)\u0001\u00da\u0010resize_normalize)\u0001\u00da\u0001x\u00a9\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>N\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"name": "conv1", "nb_filter": 24, "init": "glorot_uniform", "subsample": [2, 2], "activation": "tanh", "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"name": "conv2", "nb_filter": 36, "init": "glorot_uniform", "subsample": [2, 2], "activation": "tanh", "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"name": "conv3", "nb_filter": 48, "init": "glorot_uniform", "subsample": [2, 2], "activation": "tanh", "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"name": "conv4", "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "activation": "tanh", "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"name": "conv5", "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "activation": "tanh", "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "b_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "hidden1", "init": "glorot_uniform", "output_dim": 1164, "activation": "tanh", "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 1152}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "hidden2", "init": "glorot_uniform", "output_dim": 100, "activation": "tanh", "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 1164}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "hidden3", "init": "glorot_uniform", "output_dim": 50, "activation": "tanh", "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 100}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "hidden4", "init": "glorot_uniform", "output_dim": 10, "activation": "tanh", "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 50}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "output", "init": "glorot_uniform", "output_dim": 1, "activation": "tanh", "activity_regularizer": null, "b_constraint": null, "bias": true, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "input_dim": 10}}], "keras_version": "1.2.1"}