{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"cropping": [[60, 20], [1, 1]], "name": "cropping2d_1", "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3]}}, {"class_name": "Lambda", "config": {"arguments": {}, "name": "lambda_1", "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\n\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000\u0083\u0001\u0000S)\u0001N)\u0001\u00da\u0010resize_normalize)\u0001\u00da\u0001x\u00a9\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 80, 318, 3], "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [2, 2], "bias": true, "activation": "tanh", "activity_regularizer": null, "name": "conv1", "nb_row": 5, "border_mode": "valid", "nb_filter": 24, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [2, 2], "bias": true, "activation": "tanh", "activity_regularizer": null, "name": "conv2", "nb_row": 5, "border_mode": "valid", "nb_filter": 36, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [2, 2], "bias": true, "activation": "tanh", "activity_regularizer": null, "name": "conv3", "nb_row": 5, "border_mode": "valid", "nb_filter": 48, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [1, 1], "bias": true, "activation": "tanh", "activity_regularizer": null, "name": "conv4", "nb_row": 3, "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "b_regularizer": null, "subsample": [1, 1], "bias": true, "activation": "tanh", "activity_regularizer": null, "name": "conv5", "nb_row": 3, "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 1152, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "output_dim": 1164, "activity_regularizer": null, "name": "hidden1", "init": "glorot_uniform", "W_constraint": null, "activation": "tanh", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 1164, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "output_dim": 100, "activity_regularizer": null, "name": "hidden2", "init": "glorot_uniform", "W_constraint": null, "activation": "tanh", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 100, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "output_dim": 50, "activity_regularizer": null, "name": "hidden3", "init": "glorot_uniform", "W_constraint": null, "activation": "tanh", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 50, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "output_dim": 10, "activity_regularizer": null, "name": "hidden4", "init": "glorot_uniform", "W_constraint": null, "activation": "tanh", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 10, "trainable": true, "b_regularizer": null, "W_regularizer": null, "bias": true, "output_dim": 1, "activity_regularizer": null, "name": "output", "init": "glorot_uniform", "W_constraint": null, "activation": "tanh", "b_constraint": null}}]}