{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "cropping": [[60, 20], [1, 1]]}}, {"class_name": "Lambda", "config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize/\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\u0007\u0015\u0002\u000e\u0002", null, null], "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [2, 2], "trainable": true, "nb_row": 5, "nb_filter": 24, "nb_col": 5, "activation": "tanh", "b_constraint": null, "name": "conv1", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [2, 2], "trainable": true, "nb_row": 5, "nb_filter": 36, "nb_col": 5, "activation": "tanh", "b_constraint": null, "name": "conv2", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [2, 2], "trainable": true, "nb_row": 5, "nb_filter": 48, "nb_col": 5, "activation": "tanh", "b_constraint": null, "name": "conv3", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "trainable": true, "nb_row": 3, "nb_filter": 64, "nb_col": 3, "activation": "tanh", "b_constraint": null, "name": "conv4", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "trainable": true, "nb_row": 3, "nb_filter": 64, "nb_col": 3, "activation": "tanh", "b_constraint": null, "name": "conv5", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 1152, "output_dim": 1164, "activation": "tanh", "b_constraint": null, "name": "hidden1", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 1164, "output_dim": 100, "activation": "tanh", "b_constraint": null, "name": "hidden2", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 100, "output_dim": 50, "activation": "tanh", "b_constraint": null, "name": "hidden3", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 50, "output_dim": 10, "activation": "tanh", "b_constraint": null, "name": "hidden4", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "trainable": true, "input_dim": 10, "output_dim": 1, "activation": "tanh", "b_constraint": null, "name": "output", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_regularizer": null}}]}