{"config": [{"config": {"cropping": [[60, 20], [1, 1]], "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "cropping2d_1", "trainable": true}, "class_name": "Cropping2D"}, {"config": {"function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "output_shape": [66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize4\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\b\u0015\u0002\u000e\u0002", null, null], "output_shape_type": "raw", "input_dtype": "float32", "name": "lambda_1", "trainable": true}, "class_name": "Lambda"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 5, "nb_col": 5, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "bias": true, "trainable": true, "nb_filter": 24, "name": "conv1"}, "class_name": "Convolution2D"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 5, "nb_col": 5, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "bias": true, "trainable": true, "nb_filter": 36, "name": "conv2"}, "class_name": "Convolution2D"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 5, "nb_col": 5, "W_regularizer": null, "b_regularizer": null, "subsample": [2, 2], "bias": true, "trainable": true, "nb_filter": 48, "name": "conv3"}, "class_name": "Convolution2D"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "trainable": true, "nb_filter": 64, "name": "conv4"}, "class_name": "Convolution2D"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "trainable": true, "nb_filter": 64, "name": "conv5"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 1152, "output_dim": 1164, "name": "hidden1"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 1164, "output_dim": 100, "name": "hidden2"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 100, "output_dim": 50, "name": "hidden3"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 50, "output_dim": 10, "name": "hidden4"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 10, "output_dim": 1, "name": "output"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}