{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "name": "cropping2d_1", "trainable": true, "cropping": [[60, 20], [1, 1]], "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Cropping2D"}, {"config": {"output_shape": [66, 200, 3], "trainable": true, "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\u0007\u0000\u0000\u0000r\u0005\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\u000b\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize/\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\u0007\u0015\u0002\u000e\u0002", null, null], "input_dtype": "float32", "name": "lambda_1", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "name": "conv1", "border_mode": "valid", "bias": true, "nb_filter": 24, "W_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "name": "conv2", "border_mode": "valid", "bias": true, "nb_filter": 36, "W_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "name": "conv3", "border_mode": "valid", "bias": true, "nb_filter": 48, "W_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "subsample": [2, 2], "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "name": "conv4", "border_mode": "valid", "bias": true, "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "b_constraint": null, "name": "conv5", "border_mode": "valid", "bias": true, "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "bias": true, "name": "hidden1", "b_constraint": null, "input_dim": 1152, "W_regularizer": null, "input_dtype": "float32", "output_dim": 1164, "batch_input_shape": [null, 1152], "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "bias": true, "name": "hidden2", "b_constraint": null, "input_dim": 1164, "W_regularizer": null, "input_dtype": "float32", "output_dim": 100, "batch_input_shape": [null, 1164], "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "bias": true, "name": "hidden3", "b_constraint": null, "input_dim": 100, "W_regularizer": null, "input_dtype": "float32", "output_dim": 50, "batch_input_shape": [null, 100], "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "bias": true, "name": "hidden4", "b_constraint": null, "input_dim": 50, "W_regularizer": null, "input_dtype": "float32", "output_dim": 10, "batch_input_shape": [null, 50], "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "bias": true, "name": "output", "b_constraint": null, "input_dim": 10, "W_regularizer": null, "input_dtype": "float32", "output_dim": 1, "batch_input_shape": [null, 10], "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}], "class_name": "Sequential"}