{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "cropping": [[60, 20], [1, 1]], "input_dtype": "float32", "trainable": true}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize/\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\u0007\u0015\u0002\u000e\u0002", null, null], "name": "lambda_1", "output_shape": [66, 200, 3], "input_dtype": "float32", "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "arguments": {}, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "tanh", "nb_filter": 24, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "nb_row": 5, "name": "conv1", "border_mode": "valid", "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "tanh", "nb_filter": 36, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "nb_row": 5, "name": "conv2", "border_mode": "valid", "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "tanh", "nb_filter": 48, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "nb_row": 5, "name": "conv3", "border_mode": "valid", "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "tanh", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "name": "conv4", "border_mode": "valid", "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "tanh", "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "name": "conv5", "border_mode": "valid", "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 1152, "name": "hidden1", "output_dim": 1164, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 1164, "name": "hidden2", "output_dim": 100, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 100, "name": "hidden3", "output_dim": 50, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 50, "name": "hidden4", "output_dim": 10, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "tanh", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "input_dim": 10, "name": "output", "output_dim": 1, "W_constraint": null, "b_constraint": null, "trainable": true}}]}