{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "cropping": [[60, 20], [1, 1]], "input_dtype": "float32"}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "name": "lambda_1", "output_shape": [66, 200, 3], "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "trainable": true, "input_dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize/\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\u0007\u0015\u0002\u000e\u0002", null, null]}}, {"class_name": "Convolution2D", "config": {"name": "conv1", "nb_filter": 24, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_row": 5, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "conv2", "nb_filter": 36, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_row": 5, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "conv3", "nb_filter": 48, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_row": 5, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "conv4", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"name": "conv5", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "W_regularizer": null, "W_constraint": null, "trainable": true, "activation": "tanh", "b_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "hidden1", "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "tanh", "W_constraint": null, "input_dim": 1152, "output_dim": 1164, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "hidden2", "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "tanh", "W_constraint": null, "input_dim": 1164, "output_dim": 100, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "hidden3", "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "tanh", "W_constraint": null, "input_dim": 100, "output_dim": 50, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "hidden4", "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "tanh", "W_constraint": null, "input_dim": 50, "output_dim": 10, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "output", "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "tanh", "W_constraint": null, "input_dim": 10, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null}}]}