{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "name": "cropping2d_1", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "cropping": [[60, 20], [1, 1]]}}, {"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9 \u0000\u0000\u0000\u00e9\u0080\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize5\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\b\u0015\u0002\u000e\u0002", null, null], "function_type": "lambda", "output_shape": [32, 128, 3], "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "trainable": true, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"input_dtype": "float32", "name": "convolution2d_1", "trainable": true, "b_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "subsample": [1, 1], "batch_input_shape": [null, 32, 128, 3], "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 16, "W_constraint": null, "border_mode": "valid", "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "b_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 32, "border_mode": "valid", "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "b_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "nb_filter": 64, "border_mode": "valid", "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "input_dim": 1792, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 500, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "input_dim": 500, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 100, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "input_dim": 100, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "output_dim": 20, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "input_dim": 20, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 1, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null}}]}