{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "cropping": [[60, 20], [1, 1]]}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\t\u0000\u0000\u0000r\u0007\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\r\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize/\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\u0007\u0015\u0002\u000e\u0002", null, null], "output_shape_type": "raw", "output_shape": [66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 5, "bias": true, "name": "conv1", "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "nb_col": 5, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 24, "b_regularizer": null, "activation": "tanh", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 5, "bias": true, "name": "conv2", "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "nb_col": 5, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 36, "b_regularizer": null, "activation": "tanh", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 5, "bias": true, "name": "conv3", "subsample": [2, 2], "W_constraint": null, "border_mode": "valid", "nb_col": 5, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 48, "b_regularizer": null, "activation": "tanh", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "bias": true, "name": "conv4", "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "nb_col": 3, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "b_regularizer": null, "activation": "tanh", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "bias": true, "name": "conv5", "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "nb_col": 3, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "b_regularizer": null, "activation": "tanh", "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "hidden1", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 1164, "init": "glorot_uniform", "activation": "tanh", "b_regularizer": null, "input_dim": 1152, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "hidden2", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 100, "init": "glorot_uniform", "activation": "tanh", "b_regularizer": null, "input_dim": 1164, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "hidden3", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform", "activation": "tanh", "b_regularizer": null, "input_dim": 100, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "hidden4", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 10, "init": "glorot_uniform", "activation": "tanh", "b_regularizer": null, "input_dim": 50, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "name": "output", "W_constraint": null, "trainable": true, "b_constraint": null, "output_dim": 1, "init": "glorot_uniform", "activation": "tanh", "b_regularizer": null, "input_dim": 10, "W_regularizer": null}}], "keras_version": "1.2.1"}