{"config": [{"config": {"name": "cropping2d_1", "cropping": [[60, 20], [1, 1]], "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0007\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0005\u0000\u001bd\u0006\u0000\u0018}\u0003\u0000|\u0003\u0000S)\bN\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0004\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\u0007\u0000\u0000\u0000r\u0005\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\u000b\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0010resize_normalize/\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\u0007\u0015\u0002\u000e\u0002", null, null], "output_shape": [66, 200, 3], "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"name": "conv1", "W_regularizer": null, "nb_col": 5, "bias": true, "border_mode": "valid", "nb_row": 5, "activity_regularizer": null, "nb_filter": 24, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"name": "conv2", "W_regularizer": null, "nb_col": 5, "bias": true, "border_mode": "valid", "nb_row": 5, "activity_regularizer": null, "nb_filter": 36, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"name": "conv3", "W_regularizer": null, "nb_col": 5, "bias": true, "border_mode": "valid", "nb_row": 5, "activity_regularizer": null, "nb_filter": 48, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"name": "conv4", "W_regularizer": null, "nb_col": 3, "bias": true, "border_mode": "valid", "nb_row": 3, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"name": "conv5", "W_regularizer": null, "nb_col": 3, "bias": true, "border_mode": "valid", "nb_row": 3, "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "activation": "tanh"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "hidden1", "W_regularizer": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 1152], "input_dtype": "float32", "input_dim": 1152, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1164, "b_constraint": null, "trainable": true, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "hidden2", "W_regularizer": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 1164], "input_dtype": "float32", "input_dim": 1164, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "b_constraint": null, "trainable": true, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "hidden3", "W_regularizer": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 100], "input_dtype": "float32", "input_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "b_constraint": null, "trainable": true, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "hidden4", "W_regularizer": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 50], "input_dtype": "float32", "input_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "b_constraint": null, "trainable": true, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "output", "W_regularizer": null, "bias": true, "activity_regularizer": null, "batch_input_shape": [null, 10], "input_dtype": "float32", "input_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "b_constraint": null, "trainable": true, "W_constraint": null, "activation": "tanh"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}